fonecmid-diplom/src/Documents/ГрафикОтпусков/ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ОстаткиОтпусковСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонца</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Год) Тогда
		Объект.Год = Год(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУсловноеОформление()
	
	Элементы.ОтпускаСотрудников.УсловноеОформление.Очистить();
	
	Оформление = Элементы.ОтпускаСотрудников.УсловноеОформление.Элементы.Добавить();
	Оформление.Поле = "Строка";
	Оформление.Оформление.ЦветФона = Новый Цвет(255, 200, 200);
	Оформление.Оформление.ЦветТекста = Новый Цвет(255, 0, 0);
	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораУсловногоОформления"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДлительностьДней");
	Отбор.ВидСравнения = ВидСравнения.Больше;
	Отбор.ПравоеЗначение = 28;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	Если Объект.ОтпускаСотрудников.Количество() = 0 Тогда
		Предупреждение("Нет данных для анализа");
		Возврат;
	КонецЕсли;
	
	АдресВременногоХранилища = ПолучитьДанныеДляГантаНаСервереИСохранить();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресВременногоХранилища);
	ПараметрыФормы.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляГантаНаСервереИСохранить()
	
	Данные = Новый Структура;
	Данные.Вставить("Сотрудники", Новый Массив);
	Данные.Вставить("Имена", Новый Массив);
	Данные.Вставить("ДатыНачала", Новый Массив);
	Данные.Вставить("ДатыОкончания", Новый Массив);
	Данные.Вставить("Длительности", Новый Массив);
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Данные.Сотрудники.Добавить(Строка.Сотрудник);
		Данные.Имена.Добавить(Строка.Сотрудник.Наименование);
		Данные.ДатыНачала.Добавить(Строка.ДатаНачала);
		Данные.ДатыОкончания.Добавить(Строка.ДатаКонца);
		Данные.Длительности.Добавить((Строка.ДатаКонца - Строка.ДатаНачала) + 1);
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор);
	
	Возврат Адрес;
	
КонецФункции
